; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	image1 - mode
	thermograph0 - mode
	thermograph3 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	Star10 - direction
	Star13 - direction
	Star6 - direction
	GroundStation7 - direction
	Star1 - direction
	Star9 - direction
	Star2 - direction
	GroundStation12 - direction
	Star11 - direction
	GroundStation3 - direction
	GroundStation14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star9)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 GroundStation12)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 GroundStation14)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon17)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(pointing satellite1 Star11)
	(pointing satellite2 Star6)
	(have_image Phenomenon15 thermograph2)
	(have_image Phenomenon16 thermograph3)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 thermograph0)
))

)

; plan
1. (turn_to satellite1 star2 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star2)
   goals met: 0 of 7
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon16 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 7
5. (take_image satellite1 phenomenon16 instrument1 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon15 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 7
8. (take_image satellite1 phenomenon15 instrument1 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 3 of 7
9. (turn_to satellite1 phenomenon17 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon17)
   goals met: 3 of 7
10. (take_image satellite1 phenomenon17 instrument1 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 4 of 7
11. (turn_to satellite1 planet18 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 planet18)
   goals met: 4 of 7
12. (take_image satellite1 planet18 instrument1 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 5 of 7
13. (turn_to satellite1 star11 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star11)
   goals met: 6 of 7
14. (turn_to satellite2 star6 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star6)
   goals met: 7 of 7
